tiborsimon/embedded-tdd-headers/pic/pic18/pic18f258_tdd.h
#define TXB2SID3                      522
#define TXB2SIDH_SID3                 523
#define TXB2SID4                      524
#define TXB2SIDH_SID4                 525
#define TXB2SID5                      526
#define TXB2SIDH_SID5                 527
#define TXB2SID6                      528
#define TXB2SIDH_SID6                 529
#define TXB2SID7                      530
#define TXB2SIDH_SID7                 531
#define TXB2SID8                      532
#define TXB2SIDH_SID8                 533
#define TXB2SID9                      534
#define TXB2SIDH_SID9                 535
#define TXB2SIDH_SID10                536
#define TXB2SID10                     537
#define TXB2SIDL                      538
#define TXB2SIDL_EID16                539
#define TXB2EID16                     540
#define TXB2SIDL_EID17                541
#define TXB2EID17                     542
#define TXB2EXIDE                     543
#define TXB2SIDL_EXIDE                544
#define TXB2SIDL_SID0                 545
#define TXB2SID0                      546
#define TXB2SIDL_SID1                 547
#define TXB2SID1                      548
#define TXB2SIDL_SID2                 549
#define TXB2SID2                      550
#define TXB2EIDH                      551
#define TXB2EIDH_EID8                 552
#define TXB2EID8                      553
#define TXB2EIDH_EID9                 554
#define TXB2EID9                      555
#define TXB2EIDH_EID10                556
#define TXB2EID10                     557
#define TXB2EIDH_EID11                558
#define TXB2EID11                     559
#define TXB2EIDH_EID12                560
#define TXB2EID12                     561
#define TXB2EIDH_EID13                562
#define TXB2EID13                     563
#define TXB2EIDH_EID14                564
#define TXB2EID14                     565
#define TXB2EIDH_EID15                566
#define TXB2EID15                     567
#define TXB2EIDL                      568
#define TXB2EID0                      569
#define TXB2EIDL_EID0                 570
#define TXB2EID1                      571
#define TXB2EIDL_EID1                 572
#define TXB2EID2                      573
#define TXB2EIDL_EID2                 574
#define TXB2EID3                      575
#define TXB2EIDL_EID3                 576
#define TXB2EID4                      577
#define TXB2EIDL_EID4                 578
#define TXB2EID5                      579
#define TXB2EIDL_EID5                 580
#define TXB2EID6                      581
#define TXB2EIDL_EID6                 582
#define TXB2EID7                      583
#define TXB2EIDL_EID7                 584
#define TXB2DLC                       585
#define TXB2DLC0                      586
#define TXB2DLC_DLC0                  587
#define TXB2DLC1                      588
#define TXB2DLC_DLC1                  589
#define TXB2DLC2                      590
#define TXB2DLC_DLC2                  591
#define TXB2DLC_DLC3                  592
#define TXB2DLC3                      593
#define TXB2DLC_TXRTR                 594
#define TXB2RTR                       595
#define TXB2D0                        596
#define TXB2D00                       597
#define TXB2D01                       598
#define TXB2D02                       599
#define TXB2D03                       600
#define TXB2D04                       601
#define TXB2D05                       602
#define TXB2D06                       603
#define TXB2D07                       604
#define TXB2D1                        605
#define TXB2D10                       606
#define TXB2D11                       607
#define TXB2D12                       608
#define TXB2D13                       609
#define TXB2D14                       610
#define TXB2D15                       611
#define TXB2D16                       612
#define TXB2D17                       613
#define TXB2D2                        614
#define TXB2D20                       615
#define TXB2D21                       616
#define TXB2D22                       617
#define TXB2D23                       618
#define TXB2D24                       619
#define TXB2D25                       620
#define TXB2D26                       621
#define TXB2D27                       622
#define TXB2D3                        623
#define TXB2D30                       624
#define TXB2D31                       625
#define TXB2D32                       626
#define TXB2D33                       627
#define TXB2D34                       628
#define TXB2D35                       629
#define TXB2D36                       630
#define TXB2D37                       631
#define TXB2D4                        632
#define TXB2D40                       633
#define TXB2D41                       634
#define TXB2D42                       635
#define TXB2D43                       636
#define TXB2D44                       637
#define TXB2D45                       638
#define TXB2D46                       639
#define TXB2D47                       640
#define TXB2D5                        641
#define TXB2D50                       642
#define TXB2D51                       643
#define TXB2D52                       644
#define TXB2D53                       645
#define TXB2D54                       646
#define TXB2D55                       647
#define TXB2D56                       648
#define TXB2D57                       649
#define TXB2D6                        650
#define TXB2D60                       651
#define TXB2D61                       652
#define TXB2D62                       653
#define TXB2D63                       654
#define TXB2D64                       655
#define TXB2D65                       656
#define TXB2D66                       657
#define TXB2D67                       658
#define TXB2D7                        659
#define TXB2D70                       660
#define TXB2D71                       661
#define TXB2D72                       662
#define TXB2D73                       663
#define TXB2D74                       664
#define TXB2D75                       665
#define TXB2D76                       666
#define TXB2D77                       667
#define CANSTATRO4                    668
#define CANSTATRO4_ICODE0             669
#define CANSTATRO4_ICODE1             670
#define CANSTATRO4_ICODE2             671
#define CANSTATRO4_OPMODE0            672
#define CANSTATRO4_OPMODE1            673
#define CANSTATRO4_OPMODE2            674
#define TXB1CON                       675
#define TXB1PRI0                      676
#define TXB1CON_TXPRI0                677
#define TXB1PRI1                      678
#define TXB1CON_TXPRI1                679
#define TXB1CON_TXREQ                 680
#define TXB1REQ                       681
#define TXB1CON_TXERR                 682
#define TXB1ERR                       683
#define TXB1CON_TXLARB                684
#define TXB1LARB                      685
#define TXB1ABT                       686
#define TXB1CON_TXABT                 687
#define TXB1SIDH                      688
#define TXB1SIDH_SID3                 689
#define TXB1SID3                      690
#define TXB1SIDH_SID4                 691
#define TXB1SID4                      692
#define TXB1SIDH_SID5                 693
#define TXB1SID5                      694
#define TXB1SIDH_SID6                 695
#define TXB1SID6                      696
#define TXB1SIDH_SID7                 697
#define TXB1SID7                      698
#define TXB1SIDH_SID8                 699
#define TXB1SID8                      700
#define TXB1SIDH_SID9                 701
#define TXB1SID9                      702
#define TXB1SID10                     703
#define TXB1SIDH_SID10                704
#define TXB1SIDL                      705
#define TXB1SIDL_EID16                706
#define TXB1EID16                     707
#define TXB1SIDL_EID17                708
#define TXB1EID17                     709
#define TXB1EXIDE                     710
#define TXB1SIDL_EXIDE                711
#define TXB1SID0                      712
#define TXB1SIDL_SID0                 713
#define TXB1SID1                      714
#define TXB1SIDL_SID1                 715
#define TXB1SID2                      716
#define TXB1SIDL_SID2                 717
#define TXB1EIDH                      718
#define TXB1EID8                      719
#define TXB1EIDH_EID8                 720
#define TXB1EID9                      721
#define TXB1EIDH_EID9                 722
#define TXB1EID10                     723
#define TXB1EIDH_EID10                724
#define TXB1EID11                     725
#define TXB1EIDH_EID11                726
#define TXB1EID12                     727
#define TXB1EIDH_EID12                728
#define TXB1EID13                     729
#define TXB1EIDH_EID13                730
#define TXB1EID14                     731
#define TXB1EIDH_EID14                732
#define TXB1EID15                     733
#define TXB1EIDH_EID15                734
#define TXB1EIDL                      735
#define TXB1EIDL_EID0                 736
#define TXB1EID0                      737
#define TXB1EIDL_EID1                 738
#define TXB1EID1                      739
#define TXB1EIDL_EID2                 740
#define TXB1EID2                      741
#define TXB1EIDL_EID3                 742
#define TXB1EID3                      743
#define TXB1EIDL_EID4                 744
#define TXB1EID4                      745
#define TXB1EIDL_EID5                 746
#define TXB1EID5                      747
#define TXB1EIDL_EID6                 748
#define TXB1EID6                      749
#define TXB1EIDL_EID7                 750
#define TXB1EID7                      751
#define TXB1DLC                       752
#define TXB1DLC0                      753
#define TXB1DLC_DLC0                  754
#define TXB1DLC_DLC1                  755
#define TXB1DLC1                      756
#define TXB1DLC_DLC2                  757
#define TXB1DLC2                      758
#define TXB1DLC_DLC3                  759
#define TXB1DLC3                      760
#define TXB1RTR                       761
#define TXB1DLC_TXRTR                 762
#define TXB1D0                        763
#define TXB1D00                       764
#define TXB1D01                       765
#define TXB1D02                       766
#define TXB1D03                       767
#define TXB1D04                       768
#define TXB1D05                       769
#define TXB1D06                       770
#define TXB1D07                       771
#define TXB1D1                        772
#define TXB1D10                       773
#define TXB1D11                       774
#define TXB1D12                       775
#define TXB1D13                       776
#define TXB1D14                       777
#define TXB1D15                       778
#define TXB1D16                       779
#define TXB1D17                       780
#define TXB1D2                        781
#define TXB1D20                       782
#define TXB1D21                       783
#define TXB1D22                       784
#define TBB1D23                       785
#define TXB1D23                       786
#define TXB1D24                       787
#define TXB1D25                       788
#define TXB1D26                       789
#define TXB1D27                       790
#define TXB1D3                        791
#define TXB1D30                       792
#define TXB1D31                       793
#define TXB1D32                       794
#define TXB1D33                       795
#define TXB1D34                       796
#define TXB1D35                       797
#define TXB1D36                       798
#define TXB1D37                       799
#define TXB1D4                        800
#define TXB1D40                       801
#define TXB1D41                       802
#define TXB1D42                       803
#define TXB1D43                       804
#define TXB1D44                       805
#define TXB1D45                       806
#define TXB1D46                       807
#define TXB1D47                       808
#define TXB1D5                        809
#define TXB1D50                       810
#define TXB1D51                       811
#define TXB1D52                       812
#define TXB1D53                       813
#define TXB1D54                       814
#define TXB1D55                       815
#define TXB1D56                       816
#define TXB1D57                       817
#define TXB1D6                        818
#define TXB1D60                       819
#define TXB1D61                       820
#define TXB1D62                       821
#define TXB1D63                       822
#define TXB1D64                       823
#define TXB1D65                       824
#define TXB1D66                       825
#define TXB1D67                       826
#define TXB1D7                        827
#define TXB1D70                       828
#define TXB1D71                       829
#define TXB1D72                       830
#define TXB1D73                       831
#define TXB1D74                       832
#define TXB1D75                       833
#define TXB1D76                       834
#define TXB1D77                       835
#define CANSTATRO3                    836
#define CANSTATRO3_ICODE0             837
#define CANSTATRO3_ICODE1             838
#define CANSTATRO3_ICODE2             839
#define CANSTATRO3_OPMODE0            840
#define CANSTATRO3_OPMODE1            841
#define CANSTATRO3_OPMODE2            842
#define TXB0CON                       843
#define TXB0PRI0                      844
#define TXB0CON_TXPRI0                845
#define TXB0CON_TXPRI1                846
#define TXB0PRI1                      847
#define TXB0REQ                       848
#define TXB0CON_TXREQ                 849
#define TXB0CON_TXERR                 850
#define TXB0ERR                       851
#define TXB0CON_TXLARB                852
#define TXB0LARB                      853
#define TXB0ABT                       854
#define TXB0CON_TXABT                 855
#define TXB0SIDH                      856
#define TXB0SID3                      857
#define TXB0SIDH_SID3                 858
#define TXB0SID4                      859
#define TXB0SIDH_SID4                 860
#define TXB0SID5                      861
#define TXB0SIDH_SID5                 862
#define TXB0SID6                      863
#define TXB0SIDH_SID6                 864
#define TXB0SID7                      865
#define TXB0SIDH_SID7                 866
#define TXB0SID8                      867
#define TXB0SIDH_SID8                 868
#define TXB0SID9                      869
#define TXB0SIDH_SID9                 870
#define TXB0SIDH_SID10                871
#define TXB0SID10                     872
#define TXB0SIDL                      873
#define TXB0EID16                     874
#define TXB0SIDL_EID16                875
#define TXB0EID17                     876
#define TXB0SIDL_EID17                877
#define TXB0SIDL_EXIDE                878
#define TXB0EXIDE                     879
#define TXB0SID0                      880
#define TXB0SIDL_SID0                 881
#define TXB0SID1                      882
#define TXB0SIDL_SID1                 883
#define TXB0SID2                      884
#define TXB0SIDL_SID2                 885
#define TXB0EIDH                      886
#define TXB0EID8                      887
#define TXB0EIDH_EID8                 888
#define TXB0EID9                      889
#define TXB0EIDH_EID9                 890
#define TXB0EIDH_EID10                891
#define TXB0EID10                     892
#define TXB0EID11                     893
#define TXB0EIDH_EID11                894
#define TXB0EIDH_EID12                895
#define TXB0EID12                     896
#define TXB0EIDH_EID13                897
#define TXB0EID13                     898
#define TXB0EIDH_EID14                899
#define TXB0EID14                     900
#define TXB0EIDH_EID15                901
#define TXB0EID15                     902
#define TXB0EIDL                      903
#define TXB0EIDL_EID0                 904
#define TXB0EID0                      905
#define TXB0EIDL_EID1                 906
#define TXB0EID1                      907
#define TXB0EIDL_EID2                 908
#define TXB0EID2                      909
#define TXB0EIDL_EID3                 910
#define TXB0EID3                      911
#define TXB0EIDL_EID4                 912
#define TXB0EID4                      913
#define TXB0EIDL_EID5                 914
#define TXB0EID5                      915
#define TXB0EIDL_EID6                 916
#define TXB0EID6                      917
#define TXB0EIDL_EID7                 918
#define TXB0EID7                      919
#define TXB0DLC                       920
#define TXB0DLC0                      921
#define TXB0DLC_DLC0                  922
#define TXB0DLC1                      923
#define TXB0DLC_DLC1                  924
#define TXB0DLC2                      925
#define TXB0DLC_DLC2                  926
#define TXB0DLC3                      927
#define TXB0DLC_DLC3                  928
#define TXB0RTR                       929
#define TXB0DLC_TXRTR                 930
#define TXB0D0                        931
#define TXB0D00                       932
#define TXB0D01                       933
#define TXB0D02                       934
#define TXB0D03                       935
#define TXB0D04                       936
#define TXB0D05                       937
#define TXB0D06                       938
#define TXB0D07                       939
#define TXB0D1                        940
#define TXB0D10                       941
#define TXB0D11                       942
#define TXB0D12                       943
#define TXB0D13                       944
#define TXB0D14                       945
#define TXB0D15                       946
#define TXB0D16                       947
#define TXB0D17                       948
#define TXB0D2                        949
#define TXB0D20                       950
#define TXB0D21                       951
#define TXB0D22                       952
#define TXB0D23                       953
#define TXB0D24                       954
#define TXB0D25                       955
#define TXB0D26                       956
#define TXB0D27                       957
#define TXB0D3                        958
#define TXB0D30                       959
#define TXB0D31                       960
#define TXB0D32                       961
#define TXB0D33                       962
#define TXB0D34                       963
#define TXB0D35                       964
#define TXB0D36                       965
#define TXB0D37                       966
#define TXB0D4                        967
#define TXB0D40                       968
#define TXB0D41                       969
#define TXB0D42                       970
#define TXB0D43                       971
#define TXB0D44                       972
#define TXB0D45                       973
#define TXB0D46                       974
#define TXB0D47                       975
#define TXB0D5                        976
#define TXB0D50                       977
#define TXB0D51                       978
#define TXB0D52                       979
#define TXB0D53                       980
#define TXB0D54                       981
#define TXB0D55                       982
#define TXB0D56                       983
#define TXB0D57                       984
#define TXB0D6                        985
#define TXB0D60                       986
#define TXB0D61                       987
#define TXB0D62                       988
#define TXB0D63                       989
#define TXB0D64                       990
#define TXB0D65                       991
#define TXB0D66                       992
#define TXB0D67                       993
#define TXB0D7                        994
#define TXB0D70                       995
#define TXB0D71                       996
#define TXB0D72                       997
#define TXB0D73                       998
#define TXB0D74                       999
#define TXB0D75                       1000
#define TXB0D76                       1001
#define TXB0D77                       1002
#define CANSTATRO2                    1003
#define CANSTATRO2_ICODE0             1004
#define CANSTATRO2_ICODE1             1005
#define CANSTATRO2_ICODE2             1006
#define CANSTATRO2_OPMODE0            1007
#define CANSTATRO2_OPMODE1            1008
#define CANSTATRO2_OPMODE2            1009
#define RXB1CON                       1010
#define RXB1FILHIT0                   1011
#define RXB1CON_FILHIT0               1012
#define RXB1FILHIT1                   1013
#define FILHIT1                       1014
#define RXB1FILHIT2                   1015
#define FILHIT2                       1016
#define RXB1FILHIT3                   1017
#define RXB1RTRR0                     1018
#define RXB1CON_RXRTRRO               1019
#define RXB1RTRRO                     1020
#define RXB1CON_RXM0                  1021
#define RXB1M0                        1022
#define RXB1M1                        1023
#define RXB1CON_RXM1                  1024
#define RXB1CON_RXFUL                 1025
#define RXB1FUL                       1026
#define RXB1SIDH                      1027
#define RXB1SID3                      1028
#define RXB1SIDH_SID3                 1029
#define RXB1SID4                      1030
#define RXB1SIDH_SID4                 1031
#define RXB1SID5                      1032
#define RXB1SIDH_SID5                 1033
#define RXB1SID6                      1034
#define RXB1SIDH_SID6                 1035
#define RXB1SID7                      1036
#define RXB1SIDH_SID7                 1037
#define RXB1SID8                      1038
#define RXB1SIDH_SID8                 1039
#define RXB1SID9                      1040
#define RXB1SIDH_SID9                 1041
#define RXB1SIDH_SID10                1042
#define RXB1SID10                     1043
#define RXB1SIDL                      1044
#define RXB1SIDL_EID16                1045
#define RXB1EID16                     1046
#define RXB1SIDL_EID17                1047
#define RXB1EID17                     1048
#define RXB1EXID                      1049
#define RXB1SIDL_EXID                 1050
#define RXB1SRR                       1051
#define RXB1SIDL_SRR                  1052
#define RXB1SID0                      1053
#define RXB1SIDL_SID0                 1054
#define RXB1SIDL_SID1                 1055
#define RXB1SID1                      1056
#define RXB1SIDL_SID2                 1057
#define RXB1SID2                      1058
#define RXB1EIDH                      1059
#define RXB1EID8                      1060
#define RXB1EIDH_EID8                 1061
#define RXB1EID9                      1062
#define RXB1EIDH_EID9                 1063
#define RXB1EIDH_EID10                1064
#define RXB1EID10                     1065
#define RXB1EIDH_EID11                1066
#define RXB1EID11                     1067
#define RXB1EIDH_EID12                1068
#define RXB1EID12                     1069
#define RXB1EID13                     1070
#define RXB1EIDH_EID13                1071
#define RXB1EIDH_EID14                1072
#define RXB1EID14                     1073
#define RXB1EIDH_EID15                1074
#define RXB1EID15                     1075
#define RXB1EIDL                      1076
#define RXB1EIDL_EID0                 1077
#define RXB1EID0                      1078
#define RXB1EIDL_EID1                 1079
#define RXB1EID1                      1080
#define RXB1EIDL_EID2                 1081
#define RXB1EID2                      1082
#define RXB1EIDL_EID3                 1083
#define RXB1EID3                      1084
#define RXB1EIDL_EID4                 1085
#define RXB1EID4                      1086
#define RXB1EIDL_EID5                 1087
#define RXB1EID5                      1088
#define RXB1EIDL_EID6                 1089
#define RXB1EID6                      1090
