tiborsimon/embedded-tdd-headers/pic/pic18/pic18f258_tdd.h
#define TRISB_RB7                     1649
#define TRISB7                        1650
#define TRISC                         1651
#define TRISC0                        1652
#define TRISC_RC0                     1653
#define TRISC1                        1654
#define TRISC_RC1                     1655
#define TRISC2                        1656
#define TRISC_RC2                     1657
#define TRISC3                        1658
#define TRISC_RC3                     1659
#define TRISC4                        1660
#define TRISC_RC4                     1661
#define TRISC5                        1662
#define TRISC_RC5                     1663
#define TRISC6                        1664
#define TRISC_RC6                     1665
#define TRISC7                        1666
#define TRISC_RC7                     1667
#define PIE1                          1668
#define TMR1IE                        1669
#define TMR2IE                        1670
#define CCP1IE                        1671
#define SSPIE                         1672
#define PIE1_TX1IE                    1673
#define TXIE                          1674
#define RCIE                          1675
#define RC1IE                         1676
#define ADIE                          1677
#define PIR1                          1678
#define TMR1IF                        1679
#define TMR2IF                        1680
#define CCP1IF                        1681
#define SSPIF                         1682
#define TXIF                          1683
#define PIR1_TX1IF                    1684
#define RCIF                          1685
#define RC1IF                         1686
#define ADIF                          1687
#define IPR1                          1688
#define TMR1IP                        1689
#define TMR2IP                        1690
#define CCP1IP                        1691
#define SSPIP                         1692
#define TX1IP                         1693
#define TXIP                          1694
#define RC1IP                         1695
#define RCIP                          1696
#define ADIP                          1697
#define PIE2                          1698
#define TMR3IE                        1699
#define LVDIE                         1700
#define BCLIE                         1701
#define EEIE                          1702
#define PIR2                          1703
#define TMR3IF                        1704
#define LVDIF                         1705
#define BCLIF                         1706
#define EEIF                          1707
#define IPR2                          1708
#define TMR3IP                        1709
#define LVDIP                         1710
#define BCLIP                         1711
#define EEIP                          1712
#define PIE3                          1713
#define RXB0IE                        1714
#define RX0IE                         1715
#define RXBNIE                        1716
#define RX1IE                         1717
#define RXB1IE                        1718
#define TXB0IE                        1719
#define TX0IE                         1720
#define PIE3_TX1IE                    1721
#define TXB1IE                        1722
#define TXB2IE                        1723
#define TXBNIE                        1724
#define TX2IE                         1725
#define ERRIE                         1726
#define WAKIE                         1727
#define IRXIE                         1728
#define IVRE                          1729
#define PIR3                          1730
#define RX0IF                         1731
#define RXB0IF                        1732
#define RXBNIF                        1733
#define RX1IF                         1734
#define RXB1IF                        1735
#define TX0IF                         1736
#define TXB0IF                        1737
#define PIR3_TX1IF                    1738
#define TXB1IF                        1739
#define TXB2IF                        1740
#define TXBNIF                        1741
#define TX2IF                         1742
#define ERRIF                         1743
#define WAKIF                         1744
#define IRXIF                         1745
#define IVRF                          1746
#define IPR3                          1747
#define RXB0IP                        1748
#define RXB1IP                        1749
#define RXBNIP                        1750
#define TXB0IP                        1751
#define TXB1IP                        1752
#define TXB2IP                        1753
#define TXBNIP                        1754
#define ERRIP                         1755
#define WAKIP                         1756
#define IVRP                          1757
#define IRXIP                         1758
#define EECON1                        1759
#define RD                            1760
#define WR                            1761
#define WREN                          1762
#define WRERR                         1763
#define FREE                          1764
#define CFGS                          1765
#define EEFS                          1766
#define EEPGD                         1767
#define RCSTA                         1768
#define RCD8                          1769
#define RX9D                          1770
#define OERR                          1771
#define FERR                          1772
#define ADDEN                         1773
#define CREN                          1774
#define SREN                          1775
#define SRENA                         1776
#define RC8_9                         1777
#define RC9                           1778
#define RX9                           1779
#define nRC8                          1780
#define NOT_RC8                       1781
#define SPEN                          1782
#define TXSTA                         1783
#define TXD8                          1784
#define TX9D1                         1785
#define TX9D                          1786
#define TRMT                          1787
#define TRMT1                         1788
#define BRGH1                         1789
#define BRGH                          1790
#define SYNC                          1791
#define SYNC1                         1792
#define TXEN1                         1793
#define TXEN                          1794
#define TX91                          1795
#define TX8_9                         1796
#define TX9                           1797
#define NOT_TX8                       1798
#define nTX8                          1799
#define CSRC1                         1800
#define CSRC                          1801
#define T3CON                         1802
#define TMR3ON                        1803
#define TMR3CS                        1804
#define nT3SYNC                       1805
#define NOT_T3SYNC                    1806
#define T3SYNC                        1807
#define T3INSYNC                      1808
#define SOSCEN3                       1809
#define T3CCP1                        1810
#define T3CKPS                        1811
#define T3CKPS0                       1812
#define T3CKPS1                       1813
#define T3ECCP1                       1814
#define T3CON_RD16                    1815
#define RD163                         1816
#define T3RD16                        1817
#define CCP1CON                       1818
#define CCP1M0                        1819
#define CCP1M                         1820
#define CCP1M1                        1821
#define CCP1M2                        1822
#define CCP1M3                        1823
#define CCP1Y                         1824
#define DC1B                          1825
#define DC1B0                         1826
#define CCP1X                         1827
#define DC1B1                         1828
#define ADCON1                        1829
#define PCFG0                         1830
#define PCFG                          1831
#define PCFG1                         1832
#define PCFG2                         1833
#define CHSN3                         1834
#define PCFG3                         1835
#define ADCS2                         1836
#define ADFM                          1837
#define ADCON0                        1838
#define ADON                          1839
#define nDONE                         1840
#define GO_nDONE                      1841
#define NOT_DONE                      1842
#define GODONE                        1843
#define GO_DONE                       1844
#define DONE                          1845
#define GO                            1846
#define GO_NOT_DONE                   1847
#define CHS                           1848
#define CHS0                          1849
#define CHS1                          1850
#define CHS2                          1851
#define ADCS                          1852
#define ADCS0                         1853
#define ADCAL                         1854
#define ADCS1                         1855
#define SSPCON2                       1856
#define SEN                           1857
#define RSEN                          1858
#define PEN                           1859
#define RCEN                          1860
#define ACKEN                         1861
#define ACKDT                         1862
#define ACKSTAT                       1863
#define GCEN                          1864
#define SSPCON1                       1865
#define SSPM0                         1866
#define SSPM                          1867
#define SSPM1                         1868
#define SSPM2                         1869
#define SSPM3                         1870
#define CKP                           1871
#define SSPEN                         1872
#define SSPOV                         1873
#define WCOL                          1874
#define SSPSTAT                       1875
#define BF                            1876
#define UA                            1877
#define R_NOT_W                       1878
#define READ_WRITE                    1879
#define NOT_W                         1880
#define R_W                           1881
#define RW                            1882
#define R                             1883
#define NOT_WRITE                     1884
#define nW                            1885
#define nWRITE                        1886
#define R_nW                          1887
#define I2C_READ                      1888
#define START                         1889
#define S                             1890
#define I2C_START                     1891
#define STOP                          1892
#define I2C_STOP                      1893
#define P                             1894
#define NOT_A                         1895
#define I2C_DATA                      1896
#define nA                            1897
#define D_nA                          1898
#define D                             1899
#define DA                            1900
#define DATA_ADDRESS                  1901
#define D_A                           1902
#define D_NOT_A                       1903
#define NOT_ADDRESS                   1904
#define nADDRESS                      1905
#define I2C_DAT                       1906
#define CKE                           1907
#define SMP                           1908
#define T2CON                         1909
#define T2CKPS0                       1910
#define T2CKPS                        1911
#define T2CKPS1                       1912
#define TMR2ON                        1913
#define TOUTPS0                       1914
#define TOUTPS                        1915
#define TOUTPS1                       1916
#define TOUTPS2                       1917
#define TOUTPS3                       1918
#define PR2                           1919
#define WM0                           1920
#define WM1                           1921
#define WAIT0                         1922
#define WAIT1                         1923
#define EBDIS                         1924
#define T1CON                         1925
#define TMR1ON                        1926
#define TMR1CS                        1927
#define NOT_T1SYNC                    1928
#define T1SYNC                        1929
#define nT1SYNC                       1930
#define T1INSYNC                      1931
#define T1OSCEN                       1932
#define SOSCEN                        1933
#define T1CKPS0                       1934
#define T1CKPS                        1935
#define T1CKPS1                       1936
#define T1RD16                        1937
#define T1CON_RD16                    1938
#define RCON                          1939
#define BOR                           1940
#define NOT_BOR                       1941
#define nBOR                          1942
#define POR                           1943
#define nPOR                          1944
#define NOT_POR                       1945
#define nPD                           1946
#define NOT_PD                        1947
#define PD                            1948
#define NOT_TO                        1949
#define nTO                           1950
#define TO                            1951
#define nRI                           1952
#define NOT_RI                        1953
#define RI                            1954
#define nIPEN                         1955
#define IPEN                          1956
#define NOT_IPEN                      1957
#define WDTCON                        1958
#define SWDTE                         1959
#define SWDTEN                        1960
#define LVDCON                        1961
#define LVDL0                         1962
#define LVDL                          1963
#define LVDL1                         1964
#define LVDL2                         1965
#define LVDL3                         1966
#define LVDEN                         1967
#define IRVST                         1968
#define IVRST                         1969
#define OSCCON                        1970
#define SCS                           1971
#define T0CON                         1972
#define T0PS                          1973
#define T0PS0                         1974
#define T0PS1                         1975
#define T0PS2                         1976
#define PSA                           1977
#define T0SE                          1978
#define T0CS                          1979
#define T08BIT                        1980
#define TMR0ON                        1981
#define STATUS                        1982
#define C                             1983
#define CARRY                         1984
#define DC                            1985
#define ZERO                          1986
#define Z                             1987
#define OV                            1988
#define OVERFLOW                      1989
#define N                             1990
#define NEGATIVE                      1991
#define INTCON3                       1992
#define INT1IF                        1993
#define INT1F                         1994
#define INT2IF                        1995
#define INT2F                         1996
#define INT1E                         1997
#define INT1IE                        1998
#define INT2IE                        1999
#define INT2E                         2000
#define INT1P                         2001
#define INT1IP                        2002
#define INT2IP                        2003
#define INT2P                         2004
#define INTCON2                       2005
#define RBIP                          2006
#define TMR0IP                        2007
#define T0IP                          2008
#define INTEDG2                       2009
#define INTEDG1                       2010
#define INTEDG0                       2011
#define RBPU                          2012
#define NOT_RBPU                      2013
#define nRBPU                         2014
#define INTCON                        2015
#define RBIF                          2016
#define INT0F                         2017
#define INT0IF                        2018
#define T0IF                          2019
#define TMR0IF                        2020
#define RBIE                          2021
#define INT0E                         2022
#define INT0IE                        2023
#define T0IE                          2024
#define TMR0IE                        2025
#define PEIE                          2026
#define PEIE_GIEL                     2027
#define GIEL                          2028
#define GIE_GIEH                      2029
#define GIE                           2030
#define GIEH                          2031
#define STKPTR0                       2032
#define STKPTR                        2033
#define SP0                           2034
#define STKPTR1                       2035
#define SP1                           2036
#define STKPTR2                       2037
#define SP2                           2038
#define SP3                           2039
#define STKPTR3                       2040
#define STKPTR4                       2041
#define SP4                           2042
#define STKUNF                        2043
#define STKOVF                        2044
#define STKFUL                        2045

#endif // _PIC18F258_H_
